---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyReference
source: html/d2f6d962-2cb1-a896-a52f-1cd566317401.htm
---
# AssetPropertyReference Methods

Adds a new connected asset attached to this asset property, if it allows it.